_Rarzrabotki/Rarus/USO2/Documents/УСОERP_ИнвестиционныйНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_ИнвестиционныйНДС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОтражениеДокументовВРеглУчете</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>InformationRegister.ОтражениеДокументовВМеждународномУчете</xr:Item>
				<xr:Item>AccountingRegister.Международный</xr:Item>
				<xr:Item>AccumulationRegister.УСОERP_НДСИнвестиционный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособСтроительства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетСписанияНДС</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НДСПоСМР</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПоступления</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеУслугПрочихАктивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаНДС</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособСтроительства</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектСтроительства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НДСПоТМЦ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПоступления</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеУслугПрочихАктивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаНДС</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособСтроительства</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектСтроительства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВключениеВСтоимость</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПоступления</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеУслугПрочихАктивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаНДС</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособСтроительства</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетСписанияНДС</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектСтроительства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_ИнвестиционныйНДС/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события "ПриСозданииНаСервере" формы документа.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
		
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Объект", Объект);
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, ДополнительныеПараметры);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды   
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
// Процедура - обработчик события "ПриЧтенииНаСервере" формы документа.
//
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере();
	
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	МодификацияКонфигурацииПереопределяемый.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);

КонецПроцедуры // ПриЧтенииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УСОERP_МодификацияКонфигурацииКлиент.ПоказатьПредупреждениеДолевогоСтроительства();

КонецПроцедуры

&НаСервере
// Процедура - обработчик события "ОбработкаПроверкиЗаполненияНаСервере" формы документа.
//
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()

&НаСервере
// Процедура - обработчик события "ПередЗаписьюНаСервере" формы документа.
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) 
	
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);

КонецПроцедуры // ПередЗаписьюНаСервере()

&НаСервере
// Процедура - обработчик события "ПослеЗаписиНаСервере" формы документа.
//
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	//Элементы.ГруппаКомментарий.Картинка = ОбщегоНазначения.ПолучитьКартинкуКомментария(Объект.Комментарий);
	МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);

КонецПроцедуры // ПослеЗаписиНаСервере()

&НаКлиенте
// Процедура - обработчик события "ОбработкаОповещения" формы документа.
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
	КонецЕсли;

КонецПроцедуры // ОбработкаОповещения()

&НаКлиенте
// Процедура - обработчик события "ПослеЗаписи" формы документа.
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);

КонецПроцедуры // ПослеЗаписи()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицФормы

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля ввода ставки НДС табл. части "НДС по СМР".
//
Процедура НДСПоСМРСтавкаНДСПриИзменении(Элемент)
	
	СтрокаТаблицы = Элементы.НДСПоСМР.ТекущиеДанные;
	ПересчитатьСуммуНДСВСтрокеТаблицы(СтрокаТаблицы);
	
КонецПроцедуры // НДСПоСМРСтавкаНДСПриИзменении()

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля ввода суммы без НДС табл. части "НДС по СМР".
//
Процедура НДСПоСМРСуммаБезНДСПриИзменении(Элемент)
	
	СтрокаТаблицы = Элементы.НДСПоСМР.ТекущиеДанные;
	ПересчитатьСуммуНДСВСтрокеТаблицы(СтрокаТаблицы);
	
КонецПроцедуры // НДСПоСМРСуммаБезНДСПриИзменении()

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля ввода суммы НДС табл. части "НДС по СМР".
//
Процедура НДСПоСМРСуммаНДСПриИзменении(Элемент)
	
	СтрокаТаблицы = Элементы.НДСПоСМР.ТекущиеДанные;
	ПересчитатьСуммуБезНДСВСтрокеТаблицы(СтрокаТаблицы);
	
КонецПроцедуры // НДСПоСМРСуммаНДСПриИзменении()

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля ввода ставки НДС табл. части "НДС по ТМЦ".
//
Процедура НДСПоТМЦСтавкаНДСПриИзменении(Элемент)
	
	СтрокаТаблицы = Элементы.НДСПоТМЦ.ТекущиеДанные;
	ПересчитатьСуммуНДСВСтрокеТаблицы(СтрокаТаблицы);
	
КонецПроцедуры // НДСПоТМЦСтавкаНДСПриИзменении()

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля ввода суммы без НДС табл. части "НДС по ТМЦ".
//
Процедура НДСПоТМЦСуммаБезНДСПриИзменении(Элемент)
	
	СтрокаТаблицы = Элементы.НДСПоТМЦ.ТекущиеДанные;
	ПересчитатьСуммуНДСВСтрокеТаблицы(СтрокаТаблицы);
	
КонецПроцедуры // НДСПоТМЦСуммаБезНДСПриИзменении()

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля ввода суммы НДС табл. части "НДС по ТМЦ".
//
Процедура НДСПоТМЦСуммаНДСПриИзменении(Элемент)
	
	СтрокаТаблицы = Элементы.НДСПоТМЦ.ТекущиеДанные;
	ПересчитатьСуммуБезНДСВСтрокеТаблицы(СтрокаТаблицы);
	
КонецПроцедуры // НДСПоТМЦСуммаНДСПриИзменении()

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля ввода ставки НДС табл. части "Включение в стоимость".
//
Процедура ВключениеВСтоимостьСтавкаНДСПриИзменении(Элемент)
	
	СтрокаТаблицы = Элементы.ВключениеВСтоимость.ТекущиеДанные;
	ПересчитатьСуммуНДСВСтрокеТаблицы(СтрокаТаблицы);
	
КонецПроцедуры // ВключениеВСтоимостьСтавкаНДСПриИзменении()

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля ввода суммы без НДС табл. части "Включение в стоимость".
//
Процедура ВключениеВСтоимостьСуммаБезНДСПриИзменении(Элемент)
	
	СтрокаТаблицы = Элементы.ВключениеВСтоимость.ТекущиеДанные;
	ПересчитатьСуммуНДСВСтрокеТаблицы(СтрокаТаблицы);
	
КонецПроцедуры // ВключениеВСтоимостьСуммаБезНДСПриИзменении()

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля ввода суммы НДС табл. части "Включение в стоимость".
//
Процедура ВключениеВСтоимостьСуммаНДСПриИзменении(Элемент)
	
	СтрокаТаблицы = Элементы.ВключениеВСтоимость.ТекущиеДанные;
	ПересчитатьСуммуБезНДСВСтрокеТаблицы(СтрокаТаблицы);
	
КонецПроцедуры // ВключениеВСтоимостьСуммаНДСПриИзменении()

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 

&НаКлиенте
// Процедура - обработчик события "Нажатие" команды заполнения табл. части "НДС по СМР".
//
Процедура ЗаполнитьНДСПоСМР(Команда)
	
	Если ПроверитьВыполнениеНеобходимыхУсловийДляЗаполненияДокумента() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Объект.НДСПоСМР.Количество() = 0 Тогда

		ТекстВопроса = НСтр("ru='Перед заполнением табл. часть ""Накопление НДС по работам/услугам"" будет очищена. Продолжить?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьНДСПоСМРЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
		Возврат;

	КонецЕсли;

	ЗаполнитьНДСПоСМРНаСервере();
	
КонецПроцедуры // ЗаполнитьНДСПоСМР()

&НаКлиенте
// Завершение процедуры - обработчика события "Нажатие" команды заполнения табл. части "НДС по СМР".
//
Процедура ЗаполнитьНДСПоСМРЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
	ОтветНаВопрос = РезультатВопроса;
	Если ОтветНаВопрос = КодВозвратаДиалога.Нет Тогда
	    Возврат;
	КонецЕсли;
	
	ЗаполнитьНДСПоСМРНаСервере();

КонецПроцедуры // ЗаполнитьНДСПоСМРЗавершение()

&НаКлиенте
// Процедура - обработчик события "Нажатие" команды заполнения табл. части "НДС по ТМЦ".
//
Процедура ЗаполнитьНДСПоТМЦ(Команда)
	
	Если ПроверитьВыполнениеНеобходимыхУсловийДляЗаполненияДокумента() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Объект.НДСПоТМЦ.Количество() = 0 Тогда

		ТекстВопроса = НСтр("ru='Перед заполнением табл. часть ""Накопление НДС по материалам"" будет очищена. Продолжить?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьНДСПоТМЦЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
		Возврат;

	КонецЕсли;

	ЗаполнитьНДСПоТМЦНаСервере();
	
КонецПроцедуры // ЗаполнитьНДСПоТМЦ()

&НаКлиенте
// Завершение процедуры - обработчика события "Нажатие" команды заполнения табл. части "НДС по ТМЦ".
//
Процедура ЗаполнитьНДСПоТМЦЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
	ОтветНаВопрос = РезультатВопроса;
	Если ОтветНаВопрос = КодВозвратаДиалога.Нет Тогда
	    Возврат;
	КонецЕсли;
	
	ЗаполнитьНДСПоТМЦНаСервере();

КонецПроцедуры // ЗаполнитьНДСПоТМЦЗавершение()

&НаКлиенте
// Процедура - обработчик события "Нажатие" команды заполнения табл. части "Включение в стоимость".
//
Процедура ЗаполнитьВключениеВСтоимость(Команда)
	
	Если ПроверитьВыполнениеНеобходимыхУсловийДляЗаполненияДокумента() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Объект.ВключениеВСтоимость.Количество() = 0 Тогда

		ТекстВопроса = НСтр("ru='Перед заполнением табл. часть ""Включение НДС в стоимость объекта"" будет очищена. Продолжить?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьВключениеВСтоимостьЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
		Возврат;

	КонецЕсли;
	
	ЗаполнитьВключениеВСтоимостьНаСервере();
	
КонецПроцедуры // ЗаполнитьВключениеВСтоимость()

&НаКлиенте
// Завершение процедуры - обработчика события "Нажатие" команды заполнения табл. части "Включение в стоимость".
//
Процедура ЗаполнитьВключениеВСтоимостьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
	ОтветНаВопрос = РезультатВопроса;
	Если ОтветНаВопрос = КодВозвратаДиалога.Нет Тогда
	    Возврат;
	КонецЕсли;
	
	ЗаполнитьВключениеВСтоимостьНаСервере();

КонецПроцедуры // ЗаполнитьВключениеВСтоимостьЗавершение()

&НаСервере
// Процедура формирует структуру параметров и вызывает функцию заполнения табл. части "НДС по СМР". 
//
Процедура ЗаполнитьНДСПоСМРНаСервере()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("НачалоПериода"	   , НачалоМесяца(Объект.Дата));
	СтруктураПараметров.Вставить("ОкончаниеПериода"	   , КонецМесяца(Объект.Дата));
	СтруктураПараметров.Вставить("Организация"		   , Объект.Организация);
	СтруктураПараметров.Вставить("ОбъектСтроительства" , Объект.ОбъектСтроительства);
	
	Объект.НДСПоСМР.Загрузить(УСОERP_ДолевоеСтроительствоСервер.ПолучитьДанныеНакопленияНДСПоРаботамУслугам(СтруктураПараметров));
		
КонецПроцедуры // ЗаполнитьНДСПоСМРНаСервере()

&НаСервере
// Процедура формирует структуру параметров и вызывает функцию заполнения табл. части "НДС по ТМЦ". 
//
Процедура ЗаполнитьНДСПоТМЦНаСервере()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("НачалоПериода"	   , НачалоМесяца(Объект.Дата));
	СтруктураПараметров.Вставить("ОкончаниеПериода"	   , КонецМесяца(Объект.Дата));
	СтруктураПараметров.Вставить("Организация"		   , Объект.Организация);
	СтруктураПараметров.Вставить("ОбъектСтроительства" , Объект.ОбъектСтроительства);

	Объект.НДСПоТМЦ.Загрузить(УСОERP_ДолевоеСтроительствоСервер.ПолучитьДанныеНакопленияНДСПоМатериалам(СтруктураПараметров));
		
КонецПроцедуры // ЗаполнитьНДСПоТМЦНаСервере()

&НаСервере
// Процедура формирует структуру параметров и вызывает функцию заполнения табл. части "Включение в стоимость". 
//
Процедура ЗаполнитьВключениеВСтоимостьНаСервере()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДатаДокумента"				 , Объект.Дата);
	СтруктураПараметров.Вставить("НачалоПериода"				 , НачалоМесяца(Объект.Дата));
	СтруктураПараметров.Вставить("ОкончаниеПериода"				 , КонецМесяца(Объект.Дата));
	СтруктураПараметров.Вставить("Организация"					 , Объект.Организация);
	СтруктураПараметров.Вставить("ОбъектСтроительства"			 , Объект.ОбъектСтроительства);
	СтруктураПараметров.Вставить("НакоплениеНДСПоРаботамУслугам" , Объект.НДСПоСМР.Выгрузить()); 
	СтруктураПараметров.Вставить("НакоплениеНДСПоМатериалам"	 , Объект.НДСПоТМЦ.Выгрузить()); 

	Объект.ВключениеВСтоимость.Загрузить(УСОERP_ДолевоеСтроительствоСервер.ПолучитьДанныеВключениеНДСВСтоимостьОбъекта(СтруктураПараметров));
		
КонецПроцедуры // ЗаполнитьВключениеВСтоимостьНаСервере()

#КонецОбласти

#Область Прочее

&НаСервере
// Процедура вызывается при чтении и создании формы документа на сервере.
//
Процедура ПриЧтенииСозданииНаСервере()

	//Элементы.ГруппаКомментарий.Картинка = ОбщегоНазначения.ПолучитьКартинкуКомментария(Объект.Комментарий);
	
КонецПроцедуры // ПриЧтенииСозданииНаСервере()

&НаКлиентеНаСервереБезКонтекста
// Процедура пересчитывает поле ввода "Сумма НДС" в строке табл. части по данным ставки НДС и суммы без НДС.
//
Процедура ПересчитатьСуммуНДСВСтрокеТаблицы(СтрокаТаблицы)
	
	СтрокаТаблицы.СуммаНДС = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(СтрокаТаблицы.СуммаБезНДС, СтрокаТаблицы.СтавкаНДС, Ложь);
	
КонецПроцедуры // ПересчитатьСуммуНДСВСтрокеТаблицы()

&НаКлиентеНаСервереБезКонтекста
// Процедура пересчитывает поле ввода "Сумма без НДС" в строке табл. части по данным ставки НДС и суммы НДС.
//
Процедура ПересчитатьСуммуБезНДСВСтрокеТаблицы(СтрокаТаблицы)
	
	ТекущийПроцентНДС		  = ЦенообразованиеКлиентСервер.ПолучитьСтавкуНДСЧислом(СтрокаТаблицы.СтавкаНДС);
	СтрокаТаблицы.СуммаБезНДС = ?(ТекущийПроцентНДС = 0, 0, СтрокаТаблицы.СуммаНДС / ТекущийПроцентНДС); 
	
КонецПроцедуры // ПересчитатьСуммуБезНДСВСтрокеТаблицы()

&НаСервере
// Функция проверяет выполнение необходимых условий для заполнения документа и возвращает результаты данной проверки. 
//
Функция ПроверитьВыполнениеНеобходимыхУсловийДляЗаполненияДокумента()
	
	Возврат Документы.УСОERP_ИнвестиционныйНДС.ПроверитьНаличиеДокументовИнвестиционныйНДСЗаПериод(Объект)
		Или Документы.УСОERP_ИнвестиционныйНДС.ПроверитьНаличиеДокументовЗакрытиеОбъектаСтроительстваЗаПериод(Объект)
		Или Документы.УСОERP_ИнвестиционныйНДС.ПроверитьПроведениеТекущегоДокументаПередЗаполнением(Объект);

КонецФункции // ПроверитьВыполнениеНеобходимыхУсловийДляЗаполненияДокумента()

&НаСервере
// Процедура обновляет элементы дополнительных реквизитов при оповещении с других форм.
//
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма);
	
КонецПроцедуры // ОбновитьЭлементыДополнительныхРеквизитов()


#КонецОбласти
